import React from 'react'
import myAvatar from '../images/Im1.webp'

export default function AboutMeSection() {
  return (
    <section className="about-me  observer-section" id="about-me">
        <div className="left">
        <img src={ myAvatar } alt="Avatar" className="about-me__image" />
        </div>
        <div className="right">
        <h2 className="about-me__title"><b>Мальцев Владислав Викторович</b></h2>
        <p className="about-me__description gray">Стремлюсь к fullstack</p>
        <p className="about-me__description">
            Я начинающий веб-разработчик. Ранее изучал C++, C#, Python. В данный момент
            изучаю html, css, js, php, sql, react и redux. Хочу и дальше двигаться в 
            этом направлении.
        </p>
        <p className="about-me__description">
            Недавно я окончил Сибирский Федеральный Университет, институт математики и 
            фундаментальной информатики, кафедра вычислительных и информационных 
            технологий. Сейчас хочу найти работу, чтобы жить программированием и 
            развиваться в этом дальше.
        </p>
        <p className="about-me__description">
            В свободное время играю в компьютерные игры, смотрю YouTube и слушаю музыку. 
            В данный момент активно изучаю React.
        </p>
        <ul className="about-me__extra">
            <li className="about-me__extra-element">
            <span className="about-me__extra-icon birthday">
                <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" fill="currentColor" class="size-6">
                <path d="m15 1.784-.796.795a1.125 1.125 0 1 0 1.591 0L15 1.784ZM12 1.784l-.796.795a1.125 1.125 0 1 0 1.591 0L12 1.784ZM9 1.784l-.796.795a1.125 1.125 0 1 0 1.591 0L9 1.784ZM9.75 7.547c.498-.021.998-.035 1.5-.042V6.75a.75.75 0 0 1 1.5 0v.755c.502.007 1.002.021 1.5.042V6.75a.75.75 0 0 1 1.5 0v.88l.307.022c1.55.117 2.693 1.427 2.693 2.946v1.018a62.182 62.182 0 0 0-13.5 0v-1.018c0-1.519 1.143-2.829 2.693-2.946l.307-.022v-.88a.75.75 0 0 1 1.5 0v.797ZM12 12.75c-2.472 0-4.9.184-7.274.54-1.454.217-2.476 1.482-2.476 2.916v.384a4.104 4.104 0 0 1 2.585.364 2.605 2.605 0 0 0 2.33 0 4.104 4.104 0 0 1 3.67 0 2.605 2.605 0 0 0 2.33 0 4.104 4.104 0 0 1 3.67 0 2.605 2.605 0 0 0 2.33 0 4.104 4.104 0 0 1 2.585-.364v-.384c0-1.434-1.022-2.7-2.476-2.917A49.138 49.138 0 0 0 12 12.75ZM21.75 18.131a2.604 2.604 0 0 0-1.915.165 4.104 4.104 0 0 1-3.67 0 2.605 2.605 0 0 0-2.33 0 4.104 4.104 0 0 1-3.67 0 2.605 2.605 0 0 0-2.33 0 4.104 4.104 0 0 1-3.67 0 2.604 2.604 0 0 0-1.915-.165v2.494c0 1.035.84 1.875 1.875 1.875h15.75c1.035 0 1.875-.84 1.875-1.875v-2.494Z" />
                </svg>
            </span>
            <div className="about-me__extra-content">
                <span className="about-me__extra-title bold">Дата рождения:</span> 
                <span>12.12.2002</span>
            </div>
            </li>
            <li className="about-me__extra-element">
            <span className="about-me__extra-icon address">
                <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" fill="currentColor" class="size-6">
                <path fillRule="evenodd" d="m11.54 22.351.07.04.028.016a.76.76 0 0 0 .723 0l.028-.015.071-.041a16.975 16.975 0 0 0 1.144-.742 19.58 19.58 0 0 0 2.683-2.282c1.944-1.99 3.963-4.98 3.963-8.827a8.25 8.25 0 0 0-16.5 0c0 3.846 2.02 6.837 3.963 8.827a19.58 19.58 0 0 0 2.682 2.282 16.975 16.975 0 0 0 1.145.742ZM12 13.5a3 3 0 1 0 0-6 3 3 0 0 0 0 6Z" clipRule="evenodd" />
                </svg>
            </span>
            <div className="about-me__extra-content">
                <span className="about-me__extra-title bold">Адрес:</span> 
                <span>Россия, г. Красноярск</span>
            </div>
            </li>
            <li className="about-me__extra-element">
            <span className="about-me__extra-icon education">
                <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" fill="currentColor" class="size-7">
                <path d="M11.7 2.805a.75.75 0 0 1 .6 0A60.65 60.65 0 0 1 22.83 8.72a.75.75 0 0 1-.231 1.337 49.948 49.948 0 0 0-9.902 3.912l-.003.002c-.114.06-.227.119-.34.18a.75.75 0 0 1-.707 0A50.88 50.88 0 0 0 7.5 12.173v-.224c0-.131.067-.248.172-.311a54.615 54.615 0 0 1 4.653-2.52.75.75 0 0 0-.65-1.352 56.123 56.123 0 0 0-4.78 2.589 1.858 1.858 0 0 0-.859 1.228 49.803 49.803 0 0 0-4.634-1.527.75.75 0 0 1-.231-1.337A60.653 60.653 0 0 1 11.7 2.805Z" />
                <path d="M13.06 15.473a48.45 48.45 0 0 1 7.666-3.282c.134 1.414.22 2.843.255 4.284a.75.75 0 0 1-.46.711 47.87 47.87 0 0 0-8.105 4.342.75.75 0 0 1-.832 0 47.87 47.87 0 0 0-8.104-4.342.75.75 0 0 1-.461-.71c.035-1.442.121-2.87.255-4.286.921.304 1.83.634 2.726.99v1.27a1.5 1.5 0 0 0-.14 2.508c-.09.38-.222.753-.397 1.11.452.213.901.434 1.346.66a6.727 6.727 0 0 0 .551-1.607 1.5 1.5 0 0 0 .14-2.67v-.645a48.549 48.549 0 0 1 3.44 1.667 2.25 2.25 0 0 0 2.12 0Z" />
                <path d="M4.462 19.462c.42-.419.753-.89 1-1.395.453.214.902.435 1.347.662a6.742 6.742 0 0 1-1.286 1.794.75.75 0 0 1-1.06-1.06Z" />
                </svg>
            </span>
            <div className="about-me__extra-content">
                <span className="about-me__extra-title bold">Образование:</span>
                <span>СФУ, институт математики и фундаментальной информатики, кафердра вычислительных
                и информационных технологий</span>
            </div>
            </li>
        </ul>
        </div>
    </section>
  )
}
